package Hw2_1;

import java.util.Scanner;

public class Hw2_1
{
    //Задание 1
    public static void main(String[] args) {
        System.out.println("Hello World!");
         System.out.println("ПРИВЕТ [АЙБЕК]!");

    //Задание 2

        // 1.Алгоритм это действия решающие те или иные задачи.
        // 2.ЧИСТКА ЗУБОВ : берем зуюную щетку, намазываем зубную пасту, выметающими движениями чистим все зубы
        // в течении 2-4 минут, полоскаем зубную щетку и полоскаем рот
        // 3.Процесс компиляции -  проверка написанного кода

    //Задание 3

        System.out.println ("Сегодня мы пожарим картошку"+"\nИНГРИДИЕНТЫ: " + "\n1.Картофель" +
                "\n2.Растительное масло" +
                "\n3.Соль");
        System.out.println("ИНСТРУМЕНТЫ: \n1.Нож \n2.Сковорода \n3.Плита \n4.Дощечка для резки" );
        System.out.println("Метод приготовления:"+
                "\n1.При помощи ножа очищаем картофель от кожуры" +
                "\n2.Промываем очищенный от кожуры картофель под проточной водой" +
                "\n3.Кладем картофель на дощечку для резки" +
                "\n4.С помощью ножа режем картфоель на тонкие дольки(толщиной 4-6мм)" +
                "\n5.Включаем плиту"+
                "\n6.Ставим сковороду на плиту"+
                "\n7.Наливаем растительное масло"+
                "\n8.Выкладываем дольки картофеля на сковороду с маслом"+
                "\n9.Добавляем соль по вкусу"+
                "\nЖарим до готовности или пока картофель не будет легко прокалываться вилкой");
    }
}
